Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Links an SKP file into the document.
file:
Full path of the file to link. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014